### Solo en Google Drive

In [ ]:
import pandas as pd
# Conectamos el cuaderno actual con nuestro Drive

from google.colab import drive
drive.mount("/content/drive")

# Importar "ventas-autos.csv" y convertirlo en un nuevo DATAFRAME

ventas_autos = pd.read_csv('/content/drive/MyDrive/ventas-autos.csv')
ventas_autos

# Exportar el Dataframe como un archivo CSV a mi carpeta '/content/drive/MyDrive/ventas-autos.csv'
ventas_autos.to_csv("/content/drive/MyDrive/Colab Notebooks/pruebas/")

---

In [2]:
import pandas as pd

In [3]:
# Importamos "ventas-autos.csv"
ventas_autos = pd.read_csv('ventas-autos.csv')
ventas_autos

  Fabricante   Color  Kilometraje  Puertas Precio (USD)
0     Toyota  Blanco       150043        4    $4,000.00
1      Honda    Rojo        87899        4    $5,000.00
2     Toyota    Azul        32549        3    $7,000.00
3        BMW   Negro        11179        5   $22,000.00
4     Nissan  Blanco       213095        4    $3,500.00
5     Toyota    Rojo        99213        4    $4,500.00
6      Honda  Blanco        45698        4    $7,500.00
7      Honda  Blanco        54738        4    $7,000.00
8     Toyota  Blanco        60000        4    $6,250.00
9     Nissan    Rojo        31600        4    $9,700.00

In [20]:
 # Analicemos los tipos de datos disponibles en el dataset de ventas autos
ventas_autos.dtypes

Fabricante       object
Color            object
Kilometraje       int64
Puertas           int64
Precio (USD)    float64
dtype: object

In [19]:
# Apliquemos estadística descriptiva (cantidad de valores, media, desviación estándar, valores mínimos y máximos, cuartiles) al dataset

ventas_autos.describe()

         Kilometraje    Puertas  Precio (USD)
count      10.000000  10.000000     10.000000
mean    78601.400000   4.000000   7645.000000
std     61983.471735   0.471405   5379.407753
min     11179.000000   3.000000   3500.000000
25%     35836.250000   4.000000   4625.000000
50%     57369.000000   4.000000   6625.000000
75%     96384.500000   4.000000   7375.000000
max    213095.000000   5.000000  22000.000000

In [64]:
# Convertir columnaa de Precio en Enteros
ventas_autos['Precio (USD)'] = ventas_autos['Precio (USD)'].replace('[\$,]', '', regex=True).astype(int)

In [18]:
# Obtenemos información del dataset utilizando info()
ventas_autos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Fabricante    10 non-null     object
 1   Color         10 non-null     object
 2   Kilometraje   10 non-null     int64
 3   Puertas       10 non-null     int64
 4   Precio (USD)  10 non-null     float64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [24]:
# Listamos los nombres de las columnas de nuestro dataset
ventas_autos.columns

Index(['Fabricante', 'Color', 'Kilometraje', 'Puertas', 'Precio (USD)'], dtype='object')

In [25]:
# Averiguamos el "largo" de nuestro dataset
len(ventas_autos)

10

In [28]:
# Mostramos las primeras 5 filas del dataset
ventas_autos.head() # .head(5, 1, 3)

  Fabricante   Color  Kilometraje  Puertas  Precio (USD)
0     Toyota  Blanco       150043        4        4000.0
1      Honda    Rojo        87899        4        5000.0
2     Toyota    Azul        32549        3        7000.0
3        BMW   Negro        11179        5       22000.0
4     Nissan  Blanco       213095        4        3500.0

In [29]:
# Mostramos las primeras 7 filas del dataset
ventas_autos.head(7)

  Fabricante   Color  Kilometraje  Puertas  Precio (USD)
0     Toyota  Blanco       150043        4        4000.0
1      Honda    Rojo        87899        4        5000.0
2     Toyota    Azul        32549        3        7000.0
3        BMW   Negro        11179        5       22000.0
4     Nissan  Blanco       213095        4        3500.0
5     Toyota    Rojo        99213        4        4500.0
6      Honda  Blanco        45698        4        7500.0

In [30]:
# Mostramos las últimas 5 filas del dataset
ventas_autos.tail(5)

  Fabricante   Color  Kilometraje  Puertas  Precio (USD)
5     Toyota    Rojo        99213        4        4500.0
6      Honda  Blanco        45698        4        7500.0
7      Honda  Blanco        54738        4        7000.0
8     Toyota  Blanco        60000        4        6250.0
9     Nissan    Rojo        31600        4        9700.0

In [38]:
# Utilizamos .loc para seleccionar la fila de índice 3 del DataFrame
ventas_autos.loc[3]

Fabricante          BMW
Color             Negro
Kilometraje       11179
Puertas               5
Precio (USD)    22000.0
Name: 3, dtype: object

In [41]:
# Utilizamos .iloc para seleccionar las filas 3, 7 y 9
ventas_autos.iloc[[3, 7, 9]]

  Fabricante   Color  Kilometraje  Puertas  Precio (USD)
3        BMW   Negro        11179        5       22000.0
7      Honda  Blanco        54738        4        7000.0
9     Nissan    Rojo        31600        4        9700.0

In [43]:
# Seleccionar la columna "Kilometraje"
autos_km = ventas_autos['Kilometraje']

In [48]:
# Encontrar el valor medio de la columnas "Kilometraje"
autos_km.mean()

np.float64(78601.4)

In [65]:
# Seleccionar aquellas columnas que tengan valores superiores a 100,000 kilómetros en la columna Kilometraje
autos_km > 100000

0     True
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9    False
Name: Kilometraje, dtype: bool

In [52]:
ventas_autos[autos_km > 100000]

  Fabricante   Color  Kilometraje  Puertas  Precio (USD)
0     Toyota  Blanco       150043        4        4000.0
4     Nissan  Blanco       213095        4        3500.0

In [53]:
# Creamos una tabla cruzada de doble entrada entre Fabricante y cantidad de puertas
pd.crosstab(ventas_autos['Fabricante'],  ventas_autos['Puertas'])

Puertas     3  4  5
Fabricante
BMW         0  0  1
Honda       0  3  0
Nissan      0  2  0
Toyota      1  3  0

In [67]:
# Agrupamos las columnas por fabricante y buscamos el valor medio de las columnas numéricas
ventas_autos.groupby('Fabricante').mean(numeric_only=True)

              Kilometraje  Puertas  Precio (USD)
Fabricante
BMW          11179.000000     5.00       22000.0
Honda        62778.333333     4.00        6500.0
Nissan      122347.500000     4.00        6600.0
Toyota       85451.250000     3.75        5437.5

In [ ]:
# Importamos Matplotlib y creamos un gráfico con los valores de la columna Kilometraje